# Числа
1234, 3.1415, 3+4j, 0b11, Decimal(), Fraction()
# Строки
'spam', "Bob's", b'a\x01c', u'sp\xc4m'
# Списки
[1, [2, 'three'], 4.5], list(range(10))
# Словари
{'food': 'spam', 'taste': 'yum'}, dict(hours=10)
# Кортежи
(1, 'spam', 4, 'U'), tuple('spam'), namedtuple
# Файлы
open('eggs.txt'), open(r'C:\ham.bin', 'wb')
# Множества
set('abc'), {'a', 'b', 'c'}

# Прочие основные типы
# Булевские значения, сами типы, None

# Типы программных единиц
# Функции, модули, классы (часть 4, часть 5, часть 6)

# Типы, связанные с реализацией
# Скомпилированный код, трассировка стека (часть 4, часть 7)