# Целочисленное сложение
print(123 + 222)
# Умножение с плавающей точкой
print(1.5 * 4)
# 2 в степени 100
print(2 ** 100)
# Сколько цифр в большом числе?
print(len(str(2 ** 100)))

import math
print(math.pi)
print(math.sqrt(100))

import random
print(random.random())
print(random.choice([1, 2, 3, 4, 5]))